#include "Data.h"
#include "Globals.h"
#include "Hardware/FLASH.h"


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
static DataSettings *pDSmemInt = 0;         // | Здесь данные из ППЗУ, которые должны выводиться на экран
static uint8 *dataChanMemInt[2] = {0, 0};   //-/

static DataSettings *pDS = 0;               // Указатель на параметры рисуемого сигнала
static uint8* dataChan[2] = {0, 0};         // Указатели на данные рисуемого сигнала

uint8           *gDataAmemLast = 0;         //--
uint8           *gDataBmemLast = 0;         // | Здесь данные из ОЗУ, которые должны выводиться на экран
DataSettings    *gDSmemLast = 0;            //-/


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void Data_GetFromIntMemory(void)
{
    FLASH_GetData(gMemory.currentNumIntSignal, &pDSmemInt, &dataChanMemInt[A], &dataChanMemInt[B]);
}

//----------------------------------------------------------------------------------------------------------------------------------------------------
DataSettings* Data_DSMemInt(void)
{
    return pDSmemInt;
}

//----------------------------------------------------------------------------------------------------------------------------------------------------
DataSettings** Data_pDSMemInt(void)
{
    return &pDSmemInt;
}

//----------------------------------------------------------------------------------------------------------------------------------------------------
uint8* Data_ChMemInt(Channel ch)
{
    return dataChanMemInt[ch];
}

//----------------------------------------------------------------------------------------------------------------------------------------------------
uint8** Data_pChMemInt(Channel ch)
{
    return &(dataChanMemInt[ch]);
}

//----------------------------------------------------------------------------------------------------------------------------------------------------
DataSettings* Data_DS(void)
{
    return pDS;
}

//----------------------------------------------------------------------------------------------------------------------------------------------------
DataSettings** Data_pDS(void)
{
    return &pDS;
}

//----------------------------------------------------------------------------------------------------------------------------------------------------
uint8* Data_ChDS(Channel ch)
{
    return dataChan[ch];
}

//----------------------------------------------------------------------------------------------------------------------------------------------------
uint8** Data_pChDS(Channel ch)
{
    return &(dataChan[ch]);
}

//----------------------------------------------------------------------------------------------------------------------------------------------------
void Data_GetAverageFromDataStorage(void)
{
    dataChan[A] = DS_GetAverageData(A);
    dataChan[B] = DS_GetAverageData(B);
}
