#include "Data.h"
#include "Globals.h"
#include "Hardware/FLASH.h"


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
uint8               *gDataAmemInt = 0;  //--
uint8               *gDataBmemInt = 0;  // | Здесь данные из ППЗУ, которые должны выводиться на экран
static DataSettings *pDSmemInt = 0;     //-/


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void Data_GetFromIntMemory(void)
{
    FLASH_GetData(gMemory.currentNumIntSignal, &pDSmemInt, &gDataAmemInt, &gDataBmemInt);
}


//----------------------------------------------------------------------------------------------------------------------------------------------------
DataSettings* Data_DSMemInt(void)
{
    return pDSmemInt;
}


//----------------------------------------------------------------------------------------------------------------------------------------------------
DataSettings** Data_pDSMemInt(void)
{
    return &pDSmemInt;
}
