#pragma once
#include "Settings/DataSettings.h"


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
extern uint8        *gDataAmemInt;      // | Здесь данные из ППЗУ, которые должны выводиться на экран
extern uint8        *gDataBmemInt;      //-/

#define DS_MEM_INT  (Data_DSMemInt())

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void Data_GetFromIntMemory(void);       // Считать из ППЗУ информацию о настройках и указатели на данные
DataSettings* Data_DSMemInt(void);      // Возвращает указатель на настройки сигнала из ППЗУ
DataSettings** Data_pDSMemInt(void);    // Возвращает указатель на указатель на настройки сигнала из ППЗУ
