#pragma once
#include "Settings/DataSettings.h"


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#define DS_MEM_INT  (Data_DSMemInt())
#define CHA_MEM_INT (Data_ChMemInt(A))
#define CHB_MEM_INT (Data_ChMemInt(B))


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void Data_GetFromIntMemory(void);       // Считать из ППЗУ информацию о настройках и указатели на данные
DataSettings* Data_DSMemInt(void);      // Возвращает указатель на настройки сигнала из ППЗУ
DataSettings** Data_pDSMemInt(void);    // Возвращает указатель на указатель на настройки сигнала из ППЗУ   TODO Отрефакторить - этой функции не должно быть
uint8* Data_ChMemInt(Channel ch);       // Получить указатель на канал данных из ППЗУ
uint8** Data_pChMemInt(Channel ch);     // Возвращает указатель на указатель на канал данных на ППЗУ TODO Этой функции не должно остаться после рефакторинга


