//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*! \page page9 История изменений

    <b>29.08.2017</b> \n
    <em>10:19</em> <b>КРИТИЧЕСКИИЙ!</b> Исправлен баг, когда после балансировки канала повреждалась добавка, устанавливаемая при настройке. Критичность 
проявляется в том, что при обновлении на предыдущие версии может не вкладываться в допуски, т.к. добавлена дополнительная настройка.\n
    <b>28.08.2017</b> \n
    <em>10:51</em> Подсказки открываются по короткому нажатию кнопки ПОМОЩЬ.\n
    <em>10:18</em> В поточечном режиме не нужно ждать окончания сбора информации, чтобы получить результат автоматического измерения.\n
    <b>24.08.2017</b> \n
    <em>16:05</em> Переведены надписи внизу экрана. \n
    <em>14:07</em> Улучшен вывод на быстрых поточечных развёртках. \n
    <b>23.08.2017</b> \n
    <em>08:28</em> Исправлен вывод пикового детектора в поточечном режиме. \n
    <b>22.08.2017</b> \n
    <em>22:02</em> Корректное отображение записанного и текущего сигналов в ПАМЯТЬ-ВНУТР ЗУ. \n
    <em>21:34</em> Убраны тормоза переключений при больших мин-макс и усреднениях. \n
    <em>20:41</em> Исправлен баг, когда при включении не устанавливалась яркость дисплея. \n
    <em>20:29</em> Исправлен баг, когда ChoiceReg не становился неактивным. \n
    <em>13:44</em> Сделана отрисовка накопленных сигналов отдельным цветом. Пока только для режима "не сбрасывать". \n
    <em>13:05</em> Восстановлено сглаживание. \n
    <em>11:31</em> Подправлен цвет надписи неактивной кнопки. \n
    <em>11:13</em> Заработало накопление. \n
    <em>10:40</em> Правильно работает ждущий поточечный режим. \n
    <b>21:08:2017</b> \n
    <em>14:59</em> Исправлены цвета надписи неактивной кнопки. \n
    <b>18:08:2017</b> \n
    <em>13:17</em> Теперь усреднение работает при включенном ОТЛАДКА-РАНДОМИЗАТОР-Усрерднение и выключенном ДИСПЛЕЙ-УСРЕДНЕНИЕ. \n
    <em>12:00</em> Скорректирован вывод измерений при не всех включённых каналах. \n
    <em>11:45</em> Исправлено измерение частоты при включённом пиковом детекторе. \n
    <em>10:03</em> Корректно рассчитывается усреднение после возврата из поточечного режима. \n
    <em>09:56</em> Исправлено измерение частоты. \n
    <b>13:08:2017</b> \n
    <em>00:14</em> Исправлена отрисовка маркеров измерений. \n
    <b>11:08:2017</b> \n
    <em>16:11</em> Меандр по центру экрана. \n
    <b>10:08:2017</b> \n
    <em>16:28</em> Исправлены лампочка УСТАНОВКА и звук при открытом GovernorColor. \n
    <em>15:16</em> Теперь изображение не выходит за верхнюю границу сетки. \n
    <em>14:29</em> Восстановлена индикация выхода сигнала за пределы экрана. \n
    <em>10:03</em> Исправлен баг с отставанием сигнала на экране после выключения обоих каналов. \n
    <em>08:20</em> Исправлен баг, когда при поиске сигнала канал включался, а лампочка не загоралась. \n
*/

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
