//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*! \page page2 Алгоритм работы программы
    \tableofcontents

    \section sec1 1. Инициализация аппаратной части.

    \section sec2 2. Инициализация COM-порта.

    \section sec3 3. Загрузка настроек.

    \section sec4 4. Инициализация ПЛИС.

    \section sec5 5. Запуск процесса сбора информации ПЛИС.

    \section sec6 6. Инициализация Ethernet.

    \section sec7 7. Инициализация меню.

    \section sec8 8. Основной цикл.

        \subsection subsec1 8.1 Инициализация таймера для точных измерений.

        \subsection subsec2 8.2 Обновление Ethernet.

        \subsection subsec3 8.3 Обновление флешки.

        \subsection subsec4 8.4 Обновление ПЛИС.

        \subsection subsec5 8.5 Подготовка данных и их настроек к выводу на экран в зависимости от установленного режима.

        \subsection subsec6 8.6 Обновление панели управления.

        \subsection subsec7 8.7 Обновление состояния меню.

        \subsection subsec8 8.8 Обновление экрана.

            \subsubsection subsec81 8.8.1 Вывод данных.

            1. Перед отрисовкой данных нужно вызвать функцию Data_ReadFromRAM() (для чтения сигнала из DataStorage) или Data_Read_ReadDataROM() 
            (для чтения данных, сохранённых в ППЗУ). Эти функции читают запрошенные данные в буфера inA, inB из модуля DataBuffer.c, которые 
            расположены в CCM-памяти. Затем в этих функциях вызывается Processing_SetData(), которая приводит данные из inA, inB к текущим настройкам 
            прибора и сохраняет их в outA, outB.
            2. Затем происходит собственно отрисовка.

        \subsection subsec9 8.9 Если с панели пришла команда выключения - выключить прибор.
*/
